app/views/posts/index.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    <li>
      <b><%= post.user.first_name %> from <%= post&.user&.address&.city %>:</b>