app/controllers/posts_controller.rb

  def index
    # @posts = Post.all
    # @posts = Post.all.includes([:user])
    @posts = Post.all.includes(user: :address)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"